Newfile

<soapenv:Envelope xsi:schemaLocation="http://com/rbsg/soa/C040PaymentManagement/CustomerRetrievalForPayment/V01/ServiceParameters/V01/ CustomerRetrievalForPaymentParameters.xsd " 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:crfpSP="http://com/rbsg/soa/C040PaymentManagement/CustomerRetrievalForPayment/V01/ServiceParameters/V01/" 
xmlns:crfpTO="http://com/rbsg/soa/C040PaymentManagement/CustomerRetrievalForPayment/V01/TransferObjects/V01/"
xmlns:pdt="http://com/rbsg/soa/DataTypes/PrimitiveDataTypes/V03/"
xmlns:sdef="http://com/rbsg/soa/Services/Definitions/V03/" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
xmlns:v01="http://com/rbsg/soa/C040PaymentManagement/CustomerRetrievalForPayment/V01/">
   <soapenv:Header/>
   <soapenv:Body>
      <v01:retrievePrimaryCustomerForArr>
         <requestHeader>
            <operatingBrand>NWB</operatingBrand>
            <requestIds>
               <systemId>RequestID</systemId>
               <transactionId>123456789</transactionId>
            </requestIds>
            <requestIds>
               <systemId>SourceID</systemId>
               <transactionId>CPO</transactionId>
            </requestIds>
            <cmdType>Request</cmdType>
         </requestHeader>
         <processingParameter>
            <objectReference>
               <identifier>NWB</identifier>
               <context>
                  <schemeName>OrganizationEnterpriseIdType</schemeName>
                  <codeValue>OperatingBrandIdentifier</codeValue>
               </context>
            </objectReference>
         </processingParameter>
         <arrangementIdentifier>
            <identifier>60000145762074</identifier>
            <context>
               <schemeName>ArrangementEnterpriseIdType</schemeName>
               <codeValue>UKBasicBankAccountNumber</codeValue>
            </context>
         </arrangementIdentifier>
      </v01:retrievePrimaryCustomerForArr>
   </soapenv:Body>
</soapenv:Envelope>
